## (25/08/17) groupoids/tst/aut-test.tst : for a single piece groupoid
## =================================================================== 

## SetInfoLevel( InfoGroupoids, 4 ); 
gap> a4gens := [ (1,2,3), (2,3,4) ];;
gap> a4 := Group( a4gens );;
gap> SetName( a4, "a4" );;
gap> Ga4 := SinglePieceGroupoid( a4, [-9,-8,-7] );;
gap> Display( Ga4 );
single piece groupoid: 
  objects: [ -9, -8, -7 ]
    group: a4 = <[ (1,2,3), (2,3,4) ]>
gap> a4 := Ga4!.magma;; 
gap> ga4 := GeneratorsOfGroup( a4 );;
gap> obs := Ga4!.objects;; 
gap> ro := obs[1];; 
gap> nobs := Length( obs );; 
gap> AGa4 := AutomorphismGroupOfGroupoid( Ga4 ); 
<group with 8 generators>
gap> Size( AGa4 );
20736

gap> p := GroupoidAutomorphismByObjectPerm( Ga4, [-8,-9,-7] ); 
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,2,3) : -8 -> -8], [(2,3,4) : -8 -> -8], [() : -8 -> -9], 
      [() : -8 -> -7] ] ]
gap> x := GroupoidAutomorphismByObjectPerm( Ga4, [-9,-7,-8] ); 
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -7], 
      [() : -9 -> -8] ] ]
gap> autk := GroupHomomorphismByImages( a4, a4, a4gens, [ (1,3,2), (1,3,4) ] ); 
[ (1,2,3), (2,3,4) ] -> [ (1,3,2), (1,3,4) ]
gap> k := GroupoidAutomorphismByGroupAuto( Ga4, autk ); 
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,3,2) : -9 -> -9], [(1,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ] ]
gap> autl := GroupHomomorphismByImages( a4, a4, a4gens, [ (1,4,3), (2,4,3) ] ); 
[ (1,2,3), (2,3,4) ] -> [ (1,4,3), (2,4,3) ]
gap> l := GroupoidAutomorphismByGroupAuto( Ga4, autl ); 
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,4,3) : -9 -> -9], [(2,4,3) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ] ]
gap> rayc := [ ( ), (2,3,4), (1,3,4) ];; 
gap> c := GroupoidAutomorphismByRayShifts( Ga4, rayc ); 
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [(2,3,4) : -9 -> -8], 
      [(1,3,4) : -9 -> -7] ] ]
gap> rayd := [ ( ), (1,2)(3,4), (1,3)(2,4) ];;
gap> d := GroupoidAutomorphismByRayShifts( Ga4, rayd ); 
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [(1,2)(3,4) : -9 -> -8], 
      [(1,3)(2,4) : -9 -> -7] ] ]

gap> kcp := k*c*p; 
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,3,2) : -8 -> -8], [(1,3,4) : -8 -> -8], [(2,3,4) : -8 -> -9], 
      [(1,3,4) : -8 -> -7] ] ]
gap> ldx := l*d*x; 
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,4,3) : -9 -> -9], [(2,4,3) : -9 -> -9], [(1,2)(3,4) : -9 -> -7], 
      [(1,3)(2,4) : -9 -> -8] ] ]
gap> px := p*x; 
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,2,3) : -7 -> -7], [(2,3,4) : -7 -> -7], [() : -7 -> -9], 
      [() : -7 -> -8] ] ]
gap> xp := x*p;
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,2,3) : -8 -> -8], [(2,3,4) : -8 -> -8], [() : -8 -> -7], 
      [() : -8 -> -9] ] ]
gap> kl := k*l; 
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,3,4) : -9 -> -9], [(1,3,2) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ] ]
gap> lk := l*k;
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(2,4,3) : -9 -> -9], [(1,4,3) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ] ]
gap> cd := c*d; 
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [(1,2,4) : -9 -> -8], 
      [(2,4,3) : -9 -> -7] ] ]
gap> dc := d*c;
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [(1,3,2) : -9 -> -8], 
      [(1,4,2) : -9 -> -7] ] ]

gap> kp := k*p; 
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,3,2) : -8 -> -8], [(1,3,4) : -8 -> -8], [() : -8 -> -9], 
      [() : -8 -> -7] ] ]
gap> pk := p*k;;
gap> kp=pk; 
true
gap> cp := c*p; 
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,2,3) : -8 -> -8], [(2,3,4) : -8 -> -8], [(2,3,4) : -8 -> -9], 
      [(1,3,4) : -8 -> -7] ] ]
gap> pc := p*c;
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,3,4) : -8 -> -8], [(2,3,4) : -8 -> -8], [(2,4,3) : -8 -> -9], 
      [(1,3,2) : -8 -> -7] ] ]
gap> cp=pc; 
false

gap> autm := GroupHomomorphismByImages( a4, a4, a4gens, 
>    [ (1,2,3)^(2,3,4), (2,3,4)^(2,3,4) ] );; 
gap> m := GroupoidAutomorphismByGroupAuto( Ga4, autm ); 
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,3,4) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ] ]
gap> raye := [ ( ), (2,4,3), (1,3,2) ];;
gap> e := GroupoidAutomorphismByRayShifts( Ga4, rayd ); 
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [(1,2)(3,4) : -9 -> -8], 
      [(1,3)(2,4) : -9 -> -7] ] ]
gap> me := m*e;
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(1,3,4) : -9 -> -9], [(2,3,4) : -9 -> -9], [(1,2)(3,4) : -9 -> -8], 
      [(1,3)(2,4) : -9 -> -7] ] ]
gap> pme := p*me;
groupoid homomorphism : 
[ [ [(1,2,3) : -9 -> -9], [(2,3,4) : -9 -> -9], [() : -9 -> -8], 
      [() : -9 -> -7] ], 
  [ [(2,4,3) : -8 -> -8], [(1,4,3) : -8 -> -8], [(1,2)(3,4) : -8 -> -9], 
      [(1,4)(2,3) : -8 -> -7] ] ]
gap> cp=pme; 
false
